---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailOffset
source: html/ebb82392-4b6c-e212-3686-e5ab721eb1a5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailOffset Property

"Rail Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingRailOffset { get; }
```